-- phpMyAdmin SQL Dump
-- version 4.9.0.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Июл 15 2020 г., 05:51
-- Версия сервера: 5.5.62
-- Версия PHP: 7.3.9

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `iactive-pro`
--

-- --------------------------------------------------------

--
-- Структура таблицы `authors`
--

CREATE TABLE `authors` (
  `id` int(11) NOT NULL,
  `phone` varchar(10) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `datetime_first_message` datetime NOT NULL,
  `datetime_last_message` datetime NOT NULL,
  `messages_count` int(11) NOT NULL,
  `is_banned` tinyint(1) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `authors`
--

INSERT INTO `authors` (`id`, `phone`, `datetime_first_message`, `datetime_last_message`, `messages_count`, `is_banned`) VALUES
(1, '7999999999', '2020-07-13 00:00:00', '2020-07-15 05:42:43', 27, 0),
(2, '7999999998', '2020-07-14 15:51:02', '2020-07-15 05:42:43', 27, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `messages`
--

CREATE TABLE `messages` (
  `id` int(11) NOT NULL,
  `author_id` int(11) NOT NULL,
  `datetime` datetime NOT NULL,
  `content` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `is_deleted` tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `messages`
--

INSERT INTO `messages` (`id`, `author_id`, `datetime`, `content`, `is_deleted`) VALUES
(1, 1, '2020-07-14 17:19:40', 'Как ваши дела?', 0),
(2, 2, '2020-07-14 17:19:40', 'Привет!', 0),
(3, 1, '2020-07-14 17:28:34', 'Как ваши дела?', 0),
(4, 2, '2020-07-14 17:28:34', 'Привет!', 0),
(5, 1, '2020-07-14 17:34:25', 'Как ваши дела?', 0),
(6, 2, '2020-07-14 17:34:25', 'Привет!', 0),
(7, 1, '2020-07-14 17:36:31', 'Как ваши дела?', 0),
(8, 2, '2020-07-14 17:36:31', 'Привет!', 0),
(9, 1, '2020-07-14 17:37:44', 'Как ваши дела?', 0),
(10, 2, '2020-07-14 17:37:44', 'Привет!', 0),
(11, 1, '2020-07-14 19:27:22', 'Как ваши дела?', 0),
(12, 2, '2020-07-14 19:27:22', 'Привет!', 0),
(13, 1, '2020-07-14 19:27:48', 'Как ваши дела?', 0),
(14, 2, '2020-07-14 19:27:48', 'Привет!', 0),
(15, 1, '2020-07-14 19:32:05', 'Как ваши дела?', 0),
(16, 2, '2020-07-14 19:32:05', 'Привет!', 0),
(17, 1, '2020-07-14 19:32:18', 'Как ваши дела?', 0),
(18, 2, '2020-07-14 19:32:18', 'Привет!', 0),
(19, 1, '2020-07-14 19:32:26', 'Как ваши дела?', 0),
(20, 2, '2020-07-14 19:32:26', 'Привет!', 0),
(21, 1, '2020-07-14 19:37:43', 'Как ваши дела?', 0),
(22, 2, '2020-07-14 19:37:43', 'Привет!', 0),
(23, 1, '2020-07-14 19:37:49', 'Как ваши дела?', 0),
(24, 2, '2020-07-14 19:37:49', 'Привет!', 0),
(25, 1, '2020-07-14 19:39:08', 'Как ваши дела?', 0),
(26, 2, '2020-07-14 19:39:08', 'Привет!', 0),
(27, 1, '2020-07-14 19:39:38', 'Как ваши дела?', 0),
(28, 2, '2020-07-14 19:39:38', 'Привет!', 0),
(29, 1, '2020-07-14 19:47:57', 'Как ваши дела?', 0),
(30, 2, '2020-07-14 19:47:57', 'Привет!', 0),
(31, 1, '2020-07-14 19:50:02', 'Как ваши дела?', 0),
(32, 2, '2020-07-14 19:50:02', 'Привет!', 0),
(33, 1, '2020-07-14 20:06:27', 'Как ваши дела?', 0),
(34, 2, '2020-07-14 20:06:27', 'Привет!', 0),
(35, 1, '2020-07-14 20:07:22', 'Как ваши дела?', 0),
(36, 2, '2020-07-14 20:07:22', 'Привет!', 0),
(37, 1, '2020-07-14 20:08:49', 'Как ваши дела?', 0),
(38, 2, '2020-07-14 20:08:49', 'Привет!', 0),
(39, 1, '2020-07-14 20:09:32', 'Как ваши дела?', 0),
(40, 2, '2020-07-14 20:09:32', 'Привет!', 0),
(41, 1, '2020-07-14 21:09:12', 'Как ваши дела?', 0),
(42, 2, '2020-07-14 21:09:12', 'Привет!', 0),
(43, 1, '2020-07-14 21:15:57', 'Как ваши дела?', 0),
(44, 2, '2020-07-14 21:15:57', 'Привет!', 0),
(45, 1, '2020-07-14 21:18:25', 'Как ваши дела?', 0),
(46, 2, '2020-07-14 21:18:25', 'Привет!', 0),
(47, 1, '2020-07-14 21:36:27', 'Как ваши дела?', 0),
(48, 2, '2020-07-14 21:36:27', 'Привет!', 0),
(49, 1, '2020-07-14 22:27:24', 'Как ваши дела?', 0),
(50, 2, '2020-07-14 22:27:24', 'Привет!', 0),
(51, 1, '2020-07-15 05:40:32', 'Как ваши дела?', 0),
(52, 2, '2020-07-15 05:40:32', 'Привет!', 0),
(53, 1, '2020-07-15 05:42:43', 'Как ваши дела?', 0),
(54, 2, '2020-07-15 05:42:43', 'Привет!', 0);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `authors`
--
ALTER TABLE `authors`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `messages`
--
ALTER TABLE `messages`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `authors`
--
ALTER TABLE `authors`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `messages`
--
ALTER TABLE `messages`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=55;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
